ws-asahi/WazamonoCore/megaavr/variants/WazamonoTsurugi/pins_arduino.h
#define analogInputToDigitalPin(p)        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p) <= NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))
#define portToPinZero(port)               ((port) == PA ? PIN_PA0 : ((port) == PC ? PIN_PC3 : ((port) == PD ? PIN_PD0 : ((port) == PF ? PIN_PF0 : NOT_A_PIN))))

/* ---- PWM ----
 * millis lives on TCB0 (boards.txt -DMILLIS_USE_TIMERB0), leaving TCB1 free for
 * D3 PWM (TCB1 ALT1 = PF5) and for tone(): Tone.cpp routes tone to TCB1 whenever
 * millis is on TCB0, so tone shares TCB1 with D3 PWM - calling tone() suspends D3
 * PWM only, while D11 PWM on TCA0 keeps running (cf. Uno R3 Timer2 = D3+D11).
 * TCA0 -> PORTD: WO0..WO5 = PD0,PD1,PD2,PD3,PD4,PD5 = D6,D5,D9,D10,D11,D12. */
#if defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (0)                   /* TCB1 is millis; no TCB PWM */
#elif defined(MILLIS_USE_TIMERB0)
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PF5)      /* TCB0=millis -> TCB1 free -> D3 PWM */
#else
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PF5)
#endif
#define digitalPinHasPWMTCA(p) ( \
    (p) == PIN_PD0 || (p) == PIN_PD1 || (p) == PIN_PD2 || \
    (p) == PIN_PD3 || (p) == PIN_PD4 || (p) == PIN_PD5 )

/* TCA0 routed to PORTD: WO0..WO5 = PD0..PD5 = D6,D5,D9,D10,D11,D12. */
#define TCA0_PINS                       (PORTMUX_TCA0_PORTD_gc)
#define TCB0_PINS                       (0x00)   // TCB0 = millis; WO unused (default PA2 pos)
#define TCB1_PINS                       (0x01)   // TCB1 WO -> ALT1 (PF5 = D3)

#define PIN_TCA0_WO0_INIT               (PIN_PD0)
#define PIN_TCB0_WO_INIT                (PIN_PA2)   // TCB0 = millis; not enabled for PWM
#define PIN_TCB1_WO_INIT                (PIN_PF5)   // D3 PWM (TCB1 ALT1)

#define digitalPinHasPWM(p)             (digitalPinHasPWMTCB(p) || digitalPinHasPWMTCA(p))

/* ---- SPI (host; chip-selects are user GPIO). Tsurugi routes SPI to ALT4 (PORTD) ---- */
#define SPI_INTERFACES_COUNT            (1)
#define SPI_MUX                         (PORTMUX_SPI0_ALT4_gc)    // PD4/PD5/PD6
#define SPI_MUX_PINSWAP_4               (PORTMUX_SPI0_ALT4_gc)
#define SPI_MUX_PINSWAP_NONE            (PORTMUX_SPI0_NONE_gc)
#define PIN_SPI_MOSI                    (PIN_PD4)   // D11
#define PIN_SPI_MISO                    (PIN_PD5)   // D12
#define PIN_SPI_SCK                     (PIN_PD6)   // D13
#define PIN_SPI_SS                      (PIN_PD3)   // D10 (Uno convention; software CS, host mode)
#define PIN_SPI_MOSI_PINSWAP_4          (PIN_PD4)
#define PIN_SPI_MISO_PINSWAP_4          (PIN_PD5)
#define PIN_SPI_SCK_PINSWAP_4           (PIN_PD6)
#define PIN_SPI_SS_PINSWAP_4            (PIN_PD3)

/* ---- TWI 0 (I2C on A4/A5, Uno convention) ---- */
#define PIN_WIRE_SDA                    (PIN_PA2)   // D18 / A4
#define PIN_WIRE_SCL                    (PIN_PA3)   // D19 / A5
#define PIN_WIRE_SDA_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SCL_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SDA_PINSWAP_3          (NOT_A_PIN)
#define PIN_WIRE_SCL_PINSWAP_3          (NOT_A_PIN)

/* ---- USART0 -> "Serial0" = the Uno R3 D0/D1 UART. Default position ALT1 (PA4/PA5) ---- */
#define HWSERIAL0_MUX                   (0x00 /* PORTMUX_USART0_DEFAULT_gc - PA0/PA1 = crystal */)
#define HWSERIAL0_MUX_PINSWAP_1         (0x01 /* PORTMUX_USART0_ALT1_gc - PA4..PA7 */)
#define HWSERIAL0_MUX_PINSWAP_2         (0x02 /* PORTMUX_USART0_ALT2_gc - PA2/PA3 (= I2C) */)
#define HWSERIAL0_MUX_PINSWAP_3         (0x03 /* PORTMUX_USART0_ALT3_gc - PD4..PD7 (= SPI/AREF) */)
#define HWSERIAL0_MUX_PINSWAP_NONE      (0x05)
#define HWSERIAL0_MUX_DEFAULT          (1)   /* Tsurugi default: USART0 ALT1 (PA4/PA5). DEFAULT(PA0/PA1) is the crystal. */
#define PIN_HWSERIAL0_TX                (PIN_PA0)
#define PIN_HWSERIAL0_RX                (PIN_PA1)
#define PIN_HWSERIAL0_XCK               (PIN_PA2)
#define PIN_HWSERIAL0_XDIR              (PIN_PA3)
#define PIN_HWSERIAL0_TX_PINSWAP_1      (PIN_PA4)
#define PIN_HWSERIAL0_RX_PINSWAP_1      (PIN_PA5)
#define PIN_HWSERIAL0_XCK_PINSWAP_1     (PIN_PA6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    (PIN_PA7)
#define PIN_HWSERIAL0_TX_PINSWAP_2      (PIN_PA2)
#define PIN_HWSERIAL0_RX_PINSWAP_2      (PIN_PA3)
#define PIN_HWSERIAL0_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL0_XDIR_PINSWAP_2    (NOT_A_PIN)
#define PIN_HWSERIAL0_TX_PINSWAP_3      (PIN_PD4)
#define PIN_HWSERIAL0_RX_PINSWAP_3      (PIN_PD5)
#define PIN_HWSERIAL0_XCK_PINSWAP_3     (PIN_PD6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_3    (PIN_PD7)

/* ---- USART1 -> "Serial1": instantiated by the core, but NO usable pin position on
 *   Tsurugi (DU USART1 is only PD6/PD7 (ALT2) = SPI SCK / AREF here). Left inert. ---- */
#define HWSERIAL1_MUX                   (0x00 /* PORTMUX_USART1_DEFAULT_gc - no pins */)
#define HWSERIAL1_MUX_PINSWAP_1         (0x01 << 3 /* ALT1 absent on DU - placeholder */)
#define HWSERIAL1_MUX_PINSWAP_2         (0x02 << 3 /* PORTMUX_USART1_ALT2_gc - PD6/PD7 (occupied) */)
#define HWSERIAL1_MUX_PINSWAP_NONE      (0x03 << 3)
#define HWSERIAL1_MUX_DEFAULT          (0)
#define PIN_HWSERIAL1_TX                (NOT_A_PIN)
#define PIN_HWSERIAL1_RX                (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK               (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR              (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_RX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK_PINSWAP_1     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_2      (NOT_A_PIN)
#define PIN_HWSERIAL1_RX_PINSWAP_2      (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_2    (NOT_A_PIN)

/* ---- Arduino analog aliases. Uno R3 header = A0..A5; the remaining ADC-capable
 *      pins are also reachable as A6..A19 (one per digital pin). ---- */
#define PIN_A0   (PIN_PF0)   // D14
#define PIN_A1   (PIN_PF1)   // D15
#define PIN_A2   (PIN_PF2)   // D16
#define PIN_A3   (PIN_PF3)   // D17
#define PIN_A4   (PIN_PA2)   // D18  SDA
#define PIN_A5   (PIN_PA3)   // D19  SCL
#define PIN_A6   (PIN_PA5)   // D0
#define PIN_A7   (PIN_PA4)   // D1
#define PIN_A8   (PIN_PA6)   // D2
#define PIN_A9   (PIN_PF5)   // D3
#define PIN_A10  (PIN_PF4)   // D4
#define PIN_A11  (PIN_PD1)   // D5
#define PIN_A12  (PIN_PD0)   // D6
#define PIN_A13  (PIN_PC3)   // D7
#define PIN_A14  (PIN_PA7)   // D8
#define PIN_A15  (PIN_PD2)   // D9
#define PIN_A16  (PIN_PD3)   // D10
#define PIN_A17  (PIN_PD4)   // D11
#define PIN_A18  (PIN_PD5)   // D12
#define PIN_A19  (PIN_PD6)   // D13

/* --- Uno R4 style number-prefixed digital pin aliases (header pins D0..D19) ---
 * D-number == Arduino digital pin number. Internal-only pins (PD7 AREF, PA0/PA1
 * crystal, PF6 RESET, PF7 UPDI) are intentionally NOT exposed as Dn. */
#undef D0
#undef D1
#undef D2
#undef D3
#undef D4
#undef D5
#undef D6
#undef D7
#undef D8
#undef D9
#undef D10
#undef D11
#undef D12
#undef D13
#undef D14
#undef D15
#undef D16
#undef D17
#undef D18
#undef D19
static const uint8_t D0  = PIN_PA5;  // RX
static const uint8_t D1  = PIN_PA4;  // TX
static const uint8_t D2  = PIN_PA6;
static const uint8_t D3  = PIN_PF5;  // ~PWM(TCB1)
static const uint8_t D4  = PIN_PF4;
static const uint8_t D5  = PIN_PD1;
static const uint8_t D6  = PIN_PD0;
static const uint8_t D7  = PIN_PC3;
static const uint8_t D8  = PIN_PA7;  // native 5V
static const uint8_t D9  = PIN_PD2;
static const uint8_t D10 = PIN_PD3;  // SS (Uno convention)
static const uint8_t D11 = PIN_PD4;  // MOSI
static const uint8_t D12 = PIN_PD5;  // MISO
static const uint8_t D13 = PIN_PD6;  // SCK / LED_BUILTIN
static const uint8_t D14 = PIN_PF0;  // A0
static const uint8_t D15 = PIN_PF1;  // A1
static const uint8_t D16 = PIN_PF2;  // A2
static const uint8_t D17 = PIN_PF3;  // A3
static const uint8_t D18 = PIN_PA2;  // A4 / SDA
static const uint8_t D19 = PIN_PA3;  // A5 / SCL

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A4   = PIN_A4;
static const uint8_t A5   = PIN_A5;
static const uint8_t A6   = PIN_A6;
static const uint8_t A7   = PIN_A7;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;
static const uint8_t A11  = PIN_A11;
static const uint8_t A12  = PIN_A12;
static const uint8_t A13  = PIN_A13;
static const uint8_t A14  = PIN_A14;
static const uint8_t A15  = PIN_A15;
static const uint8_t A16  = PIN_A16;
static const uint8_t A17  = PIN_A17;
static const uint8_t A18  = PIN_A18;
static const uint8_t A19  = PIN_A19;

